# Introduction to Pandas Lab

Complete the following set of exercises to solidify your knowledge of Pandas fundamentals.

### 1. Import Numpy and Pandas and alias them to `np` and `pd` respectively.

In [1]:
import pandas as pd
import numpy as np

### 2. Create a Pandas Series containing the elements of the list below.

In [2]:
lst = [5.7, 75.2, 74.4, 84.0, 66.5, 66.3, 55.8, 75.7, 29.1, 43.7]

In [6]:
serie = pd.Series(lst)
serie

0     5.7
1    75.2
2    74.4
3    84.0
4    66.5
5    66.3
6    55.8
7    75.7
8    29.1
9    43.7
dtype: float64

### 3. Use indexing to return the third value in the Series above.

*Hint: Remember that indexing begins at 0.*

In [9]:
serie[2]

74.4

### 4. Create a Pandas DataFrame from the list of lists below. Each sublist should be represented as a row.

In [11]:
b = [[53.1, 95.0, 67.5, 35.0, 78.4],
     [61.3, 40.8, 30.8, 37.8, 87.6],
     [20.6, 73.2, 44.2, 14.6, 91.8],
     [57.4, 0.1, 96.1, 4.2, 69.5],
     [83.6, 20.5, 85.4, 22.8, 35.9],
     [49.0, 69.0, 0.1, 31.8, 89.1],
     [23.3, 40.7, 95.0, 83.8, 26.9],
     [27.6, 26.4, 53.8, 88.8, 68.5],
     [96.6, 96.4, 53.4, 72.4, 50.1],
     [73.7, 39.0, 43.2, 81.6, 34.7]]

In [13]:
df_b = pd.DataFrame(b)
df_b

      0     1     2     3     4
0  53.1  95.0  67.5  35.0  78.4
1  61.3  40.8  30.8  37.8  87.6
2  20.6  73.2  44.2  14.6  91.8
3  57.4   0.1  96.1   4.2  69.5
4  83.6  20.5  85.4  22.8  35.9
5  49.0  69.0   0.1  31.8  89.1
6  23.3  40.7  95.0  83.8  26.9
7  27.6  26.4  53.8  88.8  68.5
8  96.6  96.4  53.4  72.4  50.1
9  73.7  39.0  43.2  81.6  34.7

### 5. Rename the data frame columns based on the names in the list below.

In [14]:
b = [[53.1, 95.0, 67.5, 35.0, 78.4],
     [61.3, 40.8, 30.8, 37.8, 87.6],
     [20.6, 73.2, 44.2, 14.6, 91.8],
     [57.4, 0.1, 96.1, 4.2, 69.5],
     [83.6, 20.5, 85.4, 22.8, 35.9],
     [49.0, 69.0, 0.1, 31.8, 89.1],
     [23.3, 40.7, 95.0, 83.8, 26.9],
     [27.6, 26.4, 53.8, 88.8, 68.5],
     [96.6, 96.4, 53.4, 72.4, 50.1],
     [73.7, 39.0, 43.2, 81.6, 34.7]]

In [31]:
colnames = ['Score_1', 'Score_2', 'Score_3', 'Score_4', 'Score_5']
colnames

['Score_1', 'Score_2', 'Score_3', 'Score_4', 'Score_5']

In [32]:
df_b.columns = colnames
df_b.head()

   Score_1  Score_2  Score_3  Score_4  Score_5
0     53.1     95.0     67.5     35.0     78.4
1     61.3     40.8     30.8     37.8     87.6
2     20.6     73.2     44.2     14.6     91.8
3     57.4      0.1     96.1      4.2     69.5
4     83.6     20.5     85.4     22.8     35.9

### 6. Create a subset of this data frame that contains only the Score 1, 3, and 5 columns.

In [38]:
df_b.iloc[:, [0,2,4]]

   Score_1  Score_3  Score_5
0     53.1     67.5     78.4
1     61.3     30.8     87.6
2     20.6     44.2     91.8
3     57.4     96.1     69.5
4     83.6     85.4     35.9
5     49.0      0.1     89.1
6     23.3     95.0     26.9
7     27.6     53.8     68.5
8     96.6     53.4     50.1
9     73.7     43.2     34.7

### 7. From the original data frame, calculate the average Score_3 value.

In [42]:
df_b["Score_3"].mean()

56.95000000000001

### 8. From the original data frame, calculate the maximum Score_4 value.

In [46]:
df_b["Score_4"].max()

88.8

### 9. From the original data frame, calculate the median Score 2 value.

In [47]:
df_b["Score_2"].median()

40.75

### 10. Create a Pandas DataFrame from the dictionary of product orders below.

In [49]:
orders = {'Description': ['LUNCH BAG APPLE DESIGN',
  'SET OF 60 VINTAGE LEAF CAKE CASES ',
  'RIBBON REEL STRIPES DESIGN ',
  'WORLD WAR 2 GLIDERS ASSTD DESIGNS',
  'PLAYING CARDS JUBILEE UNION JACK',
  'POPCORN HOLDER',
  'BOX OF VINTAGE ALPHABET BLOCKS',
  'PARTY BUNTING',
  'JAZZ HEARTS ADDRESS BOOK',
  'SET OF 4 SANTA PLACE SETTINGS'],
 'Quantity': [1, 24, 1, 2880, 2, 7, 1, 4, 10, 48],
 'UnitPrice': [1.65, 0.55, 1.65, 0.18, 1.25, 0.85, 11.95, 4.95, 0.19, 1.25],
 'Revenue': [1.65, 13.2, 1.65, 518.4, 2.5, 5.95, 11.95, 19.8, 1.9, 60.0]}

In [51]:
df_orders = pd.DataFrame(orders)
df_orders

                          Description  Quantity  UnitPrice  Revenue
0              LUNCH BAG APPLE DESIGN         1       1.65     1.65
1  SET OF 60 VINTAGE LEAF CAKE CASES         24       0.55    13.20
2         RIBBON REEL STRIPES DESIGN          1       1.65     1.65
3   WORLD WAR 2 GLIDERS ASSTD DESIGNS      2880       0.18   518.40
4    PLAYING CARDS JUBILEE UNION JACK         2       1.25     2.50
5                      POPCORN HOLDER         7       0.85     5.95
6      BOX OF VINTAGE ALPHABET BLOCKS         1      11.95    11.95
7                       PARTY BUNTING         4       4.95    19.80
8            JAZZ HEARTS ADDRESS BOOK        10       0.19     1.90
9       SET OF 4 SANTA PLACE SETTINGS        48       1.25    60.00

### 11. Calculate the total quantity ordered and revenue generated from these orders.

In [55]:
df_orders["Quantity"].sum()

2978

In [54]:
df_orders["Revenue"].sum()

637.0

### 12. Obtain the prices of the most expensive and least expensive items ordered and print the difference.

In [57]:
most = df_orders["UnitPrice"].max()
least = df_orders["UnitPrice"].min()
print(most-least)

11.77

## Let's load another dataset for more exercisesÂº

In [102]:
# Run this code:
admissions = pd.read_csv('../Admission_Predict.csv')
#to remove trailing spaces at the end of the column names
admissions.columns = admissions.columns.str.rstrip()

Let's evaluate the dataset by looking at the `head` function.

In [59]:
admissions.head()

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
0,1,337,118,4,4.5,4.5,9.65,1,0.92
1,2,316,104,3,3.0,3.5,8.00,1,0.72
2,3,322,110,3,3.5,2.5,8.67,1,0.80
3,4,314,103,2,2.0,3.0,8.21,0,0.65
4,5,330,115,5,4.5,3.0,9.34,1,0.90

### 1 - Before beginning to work with this dataset and evaluating graduate admissions data, we will verify that there is no missing data in the dataset. Do this in the cell below.

In [64]:
admissions.isna().sum()

Serial No.           0
GRE Score            0
TOEFL Score          0
University Rating    0
SOP                  0
LOR                  0
CGPA                 0
Research             0
Chance of Admit      0
dtype: int64

###  2 -  Interestingly, there is a column that uniquely identifies the applicants. This column is the serial number column. Instead of having our own index, we should make this column our index. Do this in the cell below. Keep the column in the dataframe in addition to making it an index.

In [66]:
Admissions_serial = admissions.set_index("Serial No.")

In [70]:
Admissions_serial.head()

,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
Serial No.,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92
2,316,104,3,3.0,3.5,8.00,1,0.72
3,322,110,3,3.5,2.5,8.67,1,0.80
4,314,103,2,2.0,3.0,8.21,0,0.65
5,330,115,5,4.5,3.0,9.34,1,0.90

Turns out that `GRE Score` and `CGPA` also uniquely identify the data. Show this in the cell below.

In [71]:
Admissions_GreSc = admissions.set_index("GRE Score")
Admissions_GreSc.head()

,Serial No.,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
GRE Score,,,,,,,,
337,1,118,4,4.5,4.5,9.65,1,0.92
316,2,104,3,3.0,3.5,8.00,1,0.72
322,3,110,3,3.5,2.5,8.67,1,0.80
314,4,103,2,2.0,3.0,8.21,0,0.65
330,5,115,5,4.5,3.0,9.34,1,0.90

In [72]:
Admissions_CGPA = admissions.set_index("CGPA")
Admissions_CGPA .head()

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,Research,Chance of Admit
CGPA,,,,,,,,
9.65,1,337,118,4,4.5,4.5,1,0.92
8.00,2,316,104,3,3.0,3.5,1,0.72
8.67,3,322,110,3,3.5,2.5,1,0.80
8.21,4,314,103,2,2.0,3.0,0,0.65
9.34,5,330,115,5,4.5,3.0,1,0.90

### 3 - In this part of the lab, we would like to test complex conditions on the entire data set at once. Let's start by finding the number of rows where the CGPA is greater than 9 and the student has performed an investigation.

In [81]:
CGPA_9 = admissions.loc[(admissions["CGPA"] > 9)]
CGPA_9.head()

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
0,1,337,118,4,4.5,4.5,9.65,1,0.92
4,5,330,115,5,4.5,3.0,9.34,1,0.90
10,11,328,112,4,4.0,4.5,9.10,1,0.78
19,20,328,116,5,5.0,5.0,9.50,1,0.94
20,21,334,119,5,5.0,4.5,9.70,1,0.95

#### 4 - Now return all the rows where the CGPA is greater than 9 and the SOP score is less than 3.5. Find the mean chance of admit for these applicants.

In [83]:
CGPA_9_SOP = admissions.loc[(admissions["CGPA"] > 9) & (admissions["SOP"] < 3.5)]
CGPA_9_SOP.head()

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
28,29,338,118,4,3.0,4.5,9.40,1,0.91
62,63,327,114,3,3.0,3.0,9.02,0,0.61
140,141,326,114,3,3.0,3.0,9.11,1,0.83
217,218,324,111,4,3.0,3.0,9.01,1,0.82
381,382,325,107,3,3.0,3.5,9.11,1,0.84

In [85]:
CGPA_9_SOP["Chance of Admit"].mean()

0.8019999999999999

Let's create a new column based on the TOEFL Score column, where we put True if the TOEFL value is greater than 100 and False if it is less. We are going to do it with a function and an apply. 
To do this, we first create a function that receives an argument. The function will return True if the parameter entered is greater than 100, otherwise it will return False.

In [100]:
admissions["TOEFL bool"] = [True if x<100 else False for x in admissions['TOEFL Score']]
admissions.sample(10)

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit,TOEFL bool
242,243,321,114,4,4.0,5.0,9.12,0,0.85,False
69,70,314,108,4,4.5,4.0,9.04,1,0.84,False
380,381,324,110,3,3.5,3.5,9.04,1,0.82,False
259,260,294,95,1,1.5,1.5,7.64,0,0.49,True
172,173,307,102,3,3.0,3.0,8.27,0,0.73,False
125,126,339,114,5,4.0,4.5,9.76,1,0.96,False
62,63,327,114,3,3.0,3.0,9.02,0,0.61,False
142,143,311,106,2,3.5,3.0,8.26,1,0.79,False
179,180,335,118,5,4.5,3.5,9.44,1,0.93,False
225,226,329,114,5,4.5,5.0,9.19,1,0.86,False

Now we create a new column called "Decision" and apply to the TOEFL Score column

In [103]:
admissions["Decision"] = [True if x<100 else False for x in admissions['TOEFL Score']]
admissions.sample(10)

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit,Decision
136,137,340,120,4,4.5,4.0,9.92,1,0.97,False
153,154,315,103,1,1.5,2.0,7.86,0,0.57,False
148,149,312,109,3,3.0,3.0,8.69,0,0.77,False
200,201,325,108,4,4.5,4.0,9.06,1,0.79,False
155,156,318,109,3,3.0,3.0,8.50,0,0.67,False
72,73,327,112,3,3.0,3.0,8.72,1,0.74,False
206,207,322,112,4,4.5,4.5,9.26,1,0.91,False
257,258,306,105,2,2.5,3.0,8.22,1,0.72,False
264,265,320,101,2,2.5,3.0,8.62,0,0.70,False
372,373,307,105,2,2.0,3.5,8.10,0,0.53,False

Create a column called `decision2` in the `admissions` dataframe. Assign 1 to this column if the value of `SOP` is greater than 3 and 0 otherwise.    
HINT (use np.where)

In [104]:
admissions["Decision2"] = [1 if x>3 else 0 for x in admissions['SOP']]
admissions.sample(10)

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit,Decision,Decision2
275,276,314,104,4,5.0,5.0,9.02,0,0.82,False,1
368,369,300,100,3,3.0,3.5,8.26,0,0.62,False,0
212,213,308,109,2,3.0,4.0,8.45,0,0.71,False,0
339,340,297,98,2,2.5,3.0,7.67,0,0.59,True,0
163,164,312,101,2,2.5,3.5,8.04,1,0.68,False,0
139,140,315,105,3,2.0,2.5,8.48,0,0.75,False,0
229,230,317,103,2,2.5,2.0,8.15,0,0.65,False,0
326,327,326,110,3,3.5,3.5,8.76,1,0.79,False,1
74,75,296,95,2,3.0,2.0,7.54,1,0.44,True,0
238,239,320,104,3,3.0,2.5,8.57,1,0.74,False,0

In [112]:
admissions["Decision2_np"] = np.where(admissions['SOP'] > 3, 1, 0)
admissions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 385 entries, 0 to 384
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Serial No.         385 non-null    int64
 1   GRE Score          385 non-null    int64
 2   TOEFL Score        385 non-null    int64
 3   University Rating  385 non-null    int64
 4   SOP                385 non-null    float64
 5   LOR                385 non-null    float64
 6   CGPA               385 non-null    float64
 7   Research           385 non-null    int64
 8   Chance of Admit    385 non-null    float64
 9   Decision           385 non-null    bool
 10  Decision2          385 non-null    int64
 11  Decision2_np       385 non-null    int64
dtypes: bool(1), float64(4), int64(7)
memory usage: 33.6 KB